cmsis-svd/cmsis-svd/data/Atmel/ATSAMV70N19B.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>SUPC</name>
         <version>6452ZE</version>
         <description>Supply Controller</description>
         <groupName>SUPC</groupName>
         <prependToName>SUPC_</prependToName>
         <baseAddress>0x400E1810</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x18</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>SUPC</name>
            <value>0</value>
         </interrupt>
         <registers>
            <register>
               <name>SUPC_CR</name>
               <description>Supply Controller Control Register</description>
               <addressOffset>0x00</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>VROFF</name>
                     <description>Voltage Regulator Off</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>VROFFSelect</name>
                        <enumeratedValue>
                           <name>NO_EFFECT</name>
                           <description>No effect.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STOP_VREG</name>
                           <description>If KEY is correct, VROFF asserts the vddcore_nreset and stops the voltage regulator.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>XTALSEL</name>
                     <description>Crystal Oscillator Select</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>XTALSELSelect</name>
                        <enumeratedValue>
                           <name>NO_EFFECT</name>
                           <description>No effect.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CRYSTAL_SEL</name>
                           <description>If KEY is correct, XTALSEL switches the slow clock on the crystal oscillator output.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>KEY</name>
                     <description>Password</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <name>KEYSelect</name>
                        <enumeratedValue>
                           <name>PASSWD</name>
                           <description>Writing any other value in this field aborts the write operation.</description>
                           <value>0xA5</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SUPC_SMMR</name>
               <description>Supply Controller Supply Monitor Mode Register</description>
               <addressOffset>0x04</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SMTH</name>
                     <description>Supply Monitor Threshold</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>SMSMPL</name>
                     <description>Supply Monitor Sampling Period</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>SMSMPLSelect</name>
                        <enumeratedValue>
                           <name>SMD</name>
                           <description>Supply Monitor disabled</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CSM</name>
                           <description>Continuous Supply Monitor</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_32SLCK</name>
                           <description>Supply Monitor enabled one SLCK period every 32 SLCK periods</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_256SLCK</name>
                           <description>Supply Monitor enabled one SLCK period every 256 SLCK periods</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_2048SLCK</name>
                           <description>Supply Monitor enabled one SLCK period every 2,048 SLCK periods</description>
                           <value>0x4</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SMRSTEN</name>
                     <description>Supply Monitor Reset Enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SMRSTENSelect</name>
                        <enumeratedValue>
                           <name>NOT_ENABLE</name>
                           <description>The core reset signal vddcore_nreset is not affected when a supply monitor detection occurs.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>The core reset signal, vddcore_nreset is asserted when a supply monitor detection occurs.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SMIEN</name>
                     <description>Supply Monitor Interrupt Enable</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SMIENSelect</name>
                        <enumeratedValue>
                           <name>NOT_ENABLE</name>
                           <description>The SUPC interrupt signal is not affected when a supply monitor detection occurs.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>The SUPC interrupt signal is asserted when a supply monitor detection occurs.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SUPC_MR</name>
               <description>Supply Controller Mode Register</description>
               <addressOffset>0x08</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>BODRSTEN</name>
                     <description>Brownout Detector Reset Enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>BODRSTENSelect</name>
                        <enumeratedValue>
                           <name>NOT_ENABLE</name>
                           <description>The core reset signal vddcore_nreset is not affected when a brownout detection occurs.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>The core reset signal, vddcore_nreset is asserted when a brownout detection occurs.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BODDIS</name>
                     <description>Brownout Detector Disable</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>BODDISSelect</name>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>The core brownout detector is enabled.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>The core brownout detector is disabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ONREG</name>
                     <description>Voltage Regulator Enable</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ONREGSelect</name>
                        <enumeratedValue>
                           <name>ONREG_UNUSED</name>
                           <description>Internal voltage regulator is not used (external power supply is used).</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ONREG_USED</name>
                           <description>Internal voltage regulator is used.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BKUPRETON</name>
                     <description>SRAM On In Backup Mode</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSCBYPASS</name>
                     <description>Oscillator Bypass</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>OSCBYPASSSelect</name>
                        <enumeratedValue>
                           <name>NO_EFFECT</name>
                           <description>No effect. Clock selection depends on the value of XTALSEL (SUPC_CR).</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BYPASS</name>
                           <description>The 32 kHz crystal oscillator is bypassed if XTALSEL (SUPC_CR) is set. OSCBYPASS must be set prior to setting XTALSEL.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>KEY</name>
                     <description>Password Key</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <name>KEYSelect</name>
                        <enumeratedValue>
                           <name>PASSWD</name>
                           <description>Writing any other value in this field aborts the write operation.</description>
                           <value>0xA5</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
